Repository: xifOO/gitk
Catalog: i18n/locale/*/LC_MESSAGES/gitk.po
Languages: ru

source: Usage:
ru: Использование:

source: gitk <command> [options]
ru: gitk <команда> [опции]

source: Available commands:
ru: Доступные команды:

source: init Initializes a new git repository
ru: init Инициализирует новый git-репозиторий

source: add Adds specified files to the index
ru: add Добавляет указанные файлы в индекс

source: commit Generates a commit message using a neural network
ru: commit Генерирует сообщение коммита с помощью нейросети

source: push Sends changes to a remote repository
ru: push Отправляет изменения на удалённый репозиторий

source: help Displays this help message
ru: help Показывает эту справку

source: Standard git commands are also supported if no custom implementation exists.
ru: Поддерживаются также обычные команды git, если нет своей реализации.

source: Description:
ru: Описание:

source: Initializes a new git repository in the current directory.
ru: Инициализирует новый git-репозиторий в текущей директории.

source: Adds specified files to the index.
ru: Добавляет указанные файлы в индекс.

source: Examples:
ru: Примеры:

source: gitk add . # adds everything
ru: gitk add . # добавляет всё

source: After adding, a list of indexed files will be displayed.
ru: После добавления будет показан список файлов, попавших в индекс.

source: Generates a commit message based on the index changes,
ru: Генерирует сообщение коммита на основе изменений в индексе,

source: using a neural network generator.
ru: используя нейросетевой генератор.

source: Options:
ru: Опции:

source: --detailed Generate a detailed commit message
ru: --detailed Генерация подробного сообщения коммита

source: --yes, --no-confirm Skip confirmation before committing
ru: --yes, --no-confirm Не спрашивать подтверждение перед коммитом

source: --split Create a separate commit for each indexed file
ru: --split Создавать отдельный коммит для каждого файла в индексе

source: --author, --amend and other Git options are also supported
ru: --author, --amend и другие опции Git также поддерживаются

source: Sends the current branch to the remote repository.
ru: Отправляет текущую ветку на удалённый репозиторий.

source: Features:
ru: Особенности:

source: - If no remote and branch are specified, a choice will be offered
ru: - Если не указаны remote и ветка, будет предложен выбор

source: - Default remote is used: origin
ru: - Используется remote по умолчанию: origin

source: Shows this help message. You can specify a command:
ru: Показывает эту справку. Можно указать команду:

source: No help available for command: %s\n
ru: Нет справки по команде: %s\n

source: Command not specified. Example usage: gitk commit
ru: Команда не указана. Пример использования: gitk commit

source: Unknown command: %s\n
ru: Неизвестная команда: %s\n

source: Index is empty. Nothing to commit.
ru: Индекс пуст. Нечего коммитить.

source: Generating commit for file:
ru: Генерируем коммит для файла:

source: Commit:
ru: Коммит:

source: Do you want to continue? (y/n):
ru: Хотите продолжить? (y/n):

source: Skipping
ru: Пропускаем

source: File commit
ru: Коммит файла

source: Cancelled.
ru: Отменено.

source: Adding specified files: %s
ru: Добавляю указанные файлы: %s

source: Adding all changes (git add .)
ru: Добавляю все изменения (git add .)

source: No files provided to add to the index.
ru: Не переданы файлы для добавления в индекс.

source: Files in index:
ru: Файлы в индексе:

source: No configured remote repositories.
ru: Нет настроенных удаленных репозиториев (remotes).

source: Using remote:
ru: Используется remote:

source: Multiple remotes found:
ru: Найдено несколько remotes:

source: Select remote number for push:
ru: Выберите номер remote для push:

source: Selected remote:
ru: Выбран remote:

source: Invalid input
ru: Неверный ввод

source: Enter branch name for push [default:
ru: Введите имя ветки для push [по умолчанию:

source: Branch not specified. Using:
ru: Ветка не указана. Используем:

source: Using branch:
ru: Используем ветку:

source: Welcome to GitK
ru: Добро пожаловать в GitK

source: To use commit message generation via ChatGPT,
ru: Чтобы использовать генерацию сообщений коммитов с помощью ChatGPT,

source: you need to provide your OpenAI API key.
ru: необходимо указать ваш OpenAI API ключ.

source: The key will be saved locally at:
ru: Ключ будет сохранён локально в:

source: This file:
ru: Этот файл:

source: will be accessible only by you (permissions 600)
ru: будет доступен только вам (права доступа 600)

source: WILL NOT be pushed to any repositories
ru: НЕ будет отправлен ни в какие репозитории

source: can be deleted or changed at any time
ru: может быть удалён или изменён в любой момент

source: You can also use the OPENAI_API_KEY environment variable instead of this step.
ru: Вы также можете использовать переменную окружения OPENAI_API_KEY вместо этого шага.

source: Are you sure you want to delete the saved key? (y/n):
ru: Вы точно хотите удалить сохраненный ключ? (y/n):

source: Key deleted.
ru: Ключ удалён.

source: Key was not deleted.
ru: Ключ не был очищен.

source: You have no saved key.
ru: У вас нет сохраненного ключа.

source: Continue and enter the key? (y/n):
ru: Продолжить и ввести ключ? (y/n):

source: You can use the OPENAI_API_KEY environment variable instead of this step.
ru: Вы можете использовать переменную окружения OPENAI_API_KEY вместо этого шага.

source: Configuration file already exists.
ru: Файл конфигурации уже существует.

source: Do you want to overwrite the key? (y/n):
ru: Хотите перезаписать ключ? (y/n):

source: The key will not be changed. Use gitk help to explore available commands.
ru: Ключ не будет изменён. Вы можете использовать gitk help для ознакомления с командами.

source: Enter your OpenAI API key:
ru: Введите ваш OpenAI API ключ:

source: Key successfully saved to
ru: Ключ успешно сохранён в
